Revit 2027 API
WorksetKindFilter(WorksetKind) Constructor
 Constructs a new instance of WorksetKindFilter filter to match worksets of the given WorksetKind.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public WorksetKindFilter(
	WorksetKind worksetKind
)
Public Sub New (
	worksetKind As WorksetKind
)
public:
WorksetKindFilter(
	WorksetKind worksetKind
)
new :
        worksetKind : WorksetKind -> WorksetKindFilter
Parameters
worksetKind WorksetKind
 The WorksetKind to match.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
WorksetKindFilter Class
WorksetKindFilter Overload
Autodesk.Revit.DB Namespace